keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMtu_bf.h
/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU0PCMAP */
#define IFX_MTU_MEMMAP_CPU0PCMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU0PCMAP */
#define IFX_MTU_MEMMAP_CPU0PCMAP_OFF (15)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU0PTMAP */
#define IFX_MTU_MEMMAP_CPU0PTMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU0PTMAP */
#define IFX_MTU_MEMMAP_CPU0PTMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU0PTMAP */
#define IFX_MTU_MEMMAP_CPU0PTMAP_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU1DCMAP */
#define IFX_MTU_MEMMAP_CPU1DCMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU1DCMAP */
#define IFX_MTU_MEMMAP_CPU1DCMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU1DCMAP */
#define IFX_MTU_MEMMAP_CPU1DCMAP_OFF (7)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU1DTMAP */
#define IFX_MTU_MEMMAP_CPU1DTMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU1DTMAP */
#define IFX_MTU_MEMMAP_CPU1DTMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU1DTMAP */
#define IFX_MTU_MEMMAP_CPU1DTMAP_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU1PCMAP */
#define IFX_MTU_MEMMAP_CPU1PCMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU1PCMAP */
#define IFX_MTU_MEMMAP_CPU1PCMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU1PCMAP */
#define IFX_MTU_MEMMAP_CPU1PCMAP_OFF (10)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU1PTMAP */
#define IFX_MTU_MEMMAP_CPU1PTMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU1PTMAP */
#define IFX_MTU_MEMMAP_CPU1PTMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU1PTMAP */
#define IFX_MTU_MEMMAP_CPU1PTMAP_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU2DCMAP */
#define IFX_MTU_MEMMAP_CPU2DCMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU2DCMAP */
#define IFX_MTU_MEMMAP_CPU2DCMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU2DCMAP */
#define IFX_MTU_MEMMAP_CPU2DCMAP_OFF (1)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU2DTMAP */
#define IFX_MTU_MEMMAP_CPU2DTMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU2DTMAP */
#define IFX_MTU_MEMMAP_CPU2DTMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU2DTMAP */
#define IFX_MTU_MEMMAP_CPU2DTMAP_OFF (2)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU2PCMAP */
#define IFX_MTU_MEMMAP_CPU2PCMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU2PCMAP */
#define IFX_MTU_MEMMAP_CPU2PCMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU2PCMAP */
#define IFX_MTU_MEMMAP_CPU2PCMAP_OFF (4)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU2PTMAP */
#define IFX_MTU_MEMMAP_CPU2PTMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU2PTMAP */
#define IFX_MTU_MEMMAP_CPU2PTMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU2PTMAP */
#define IFX_MTU_MEMMAP_CPU2PTMAP_OFF (5)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0DTAIU */
#define IFX_MTU_MEMSTAT0_CPU0DTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0DTAIU */
#define IFX_MTU_MEMSTAT0_CPU0DTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0DTAIU */
#define IFX_MTU_MEMSTAT0_CPU0DTAIU_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_OFF (20)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_OFF (6)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_OFF (9)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_OFF (21)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2DSAIU */
#define IFX_MTU_MEMSTAT0_CPU2DSAIU_LEN (1)

