keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMtu_bf.h
/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_OFF (22)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_OFF (26)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_OFF (31)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_OFF (28)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_OFF (29)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_OFF (30)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_OFF (12)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_OFF (13)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_OFF (7)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_OFF (24)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_OFF (25)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_OFF (26)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_OFF (27)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_OFF (28)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_OFF (29)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_OFF (15)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_OFF (18)

