keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMtu_bf.h
/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_OFF (12)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_OFF (15)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU10EN */
#define IFX_MTU_MEMTEST2_EMEMU10EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU10EN */
#define IFX_MTU_MEMTEST2_EMEMU10EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU10EN */
#define IFX_MTU_MEMTEST2_EMEMU10EN_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU11EN */
#define IFX_MTU_MEMTEST2_EMEMU11EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU11EN */
#define IFX_MTU_MEMTEST2_EMEMU11EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU11EN */
#define IFX_MTU_MEMTEST2_EMEMU11EN_OFF (9)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU12EN */
#define IFX_MTU_MEMTEST2_EMEMU12EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU12EN */
#define IFX_MTU_MEMTEST2_EMEMU12EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU12EN */
#define IFX_MTU_MEMTEST2_EMEMU12EN_OFF (10)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU13EN */
#define IFX_MTU_MEMTEST2_EMEMU13EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU13EN */
#define IFX_MTU_MEMTEST2_EMEMU13EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU13EN */
#define IFX_MTU_MEMTEST2_EMEMU13EN_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU14EN */
#define IFX_MTU_MEMTEST2_EMEMU14EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU14EN */
#define IFX_MTU_MEMTEST2_EMEMU14EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU14EN */
#define IFX_MTU_MEMTEST2_EMEMU14EN_OFF (12)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU15EN */
#define IFX_MTU_MEMTEST2_EMEMU15EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU15EN */
#define IFX_MTU_MEMTEST2_EMEMU15EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU15EN */
#define IFX_MTU_MEMTEST2_EMEMU15EN_OFF (13)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU2EN */
#define IFX_MTU_MEMTEST2_EMEMU2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU2EN */
#define IFX_MTU_MEMTEST2_EMEMU2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU2EN */
#define IFX_MTU_MEMTEST2_EMEMU2EN_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU3EN */
#define IFX_MTU_MEMTEST2_EMEMU3EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU3EN */
#define IFX_MTU_MEMTEST2_EMEMU3EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU3EN */
#define IFX_MTU_MEMTEST2_EMEMU3EN_OFF (1)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU4EN */
#define IFX_MTU_MEMTEST2_EMEMU4EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU4EN */
#define IFX_MTU_MEMTEST2_EMEMU4EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU4EN */
#define IFX_MTU_MEMTEST2_EMEMU4EN_OFF (2)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU5EN */
#define IFX_MTU_MEMTEST2_EMEMU5EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU5EN */
#define IFX_MTU_MEMTEST2_EMEMU5EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU5EN */
#define IFX_MTU_MEMTEST2_EMEMU5EN_OFF (3)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU6EN */
#define IFX_MTU_MEMTEST2_EMEMU6EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU6EN */
#define IFX_MTU_MEMTEST2_EMEMU6EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU6EN */
#define IFX_MTU_MEMTEST2_EMEMU6EN_OFF (4)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU7EN */
#define IFX_MTU_MEMTEST2_EMEMU7EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU7EN */
#define IFX_MTU_MEMTEST2_EMEMU7EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU7EN */
#define IFX_MTU_MEMTEST2_EMEMU7EN_OFF (5)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU8EN */
#define IFX_MTU_MEMTEST2_EMEMU8EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU8EN */
#define IFX_MTU_MEMTEST2_EMEMU8EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU8EN */
#define IFX_MTU_MEMTEST2_EMEMU8EN_OFF (6)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMU9EN */
#define IFX_MTU_MEMTEST2_EMEMU9EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMU9EN */
#define IFX_MTU_MEMTEST2_EMEMU9EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMU9EN */
#define IFX_MTU_MEMTEST2_EMEMU9EN_OFF (7)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.FFT0EN */
#define IFX_MTU_MEMTEST2_FFT0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.FFT0EN */
#define IFX_MTU_MEMTEST2_FFT0EN_MSK (0x1)

